"""
Наше домашнє завдання полягає в наступному. У межах вашої організації, ви відповідаєте за
організацію привітань колег з днем народження. Щоб оптимізувати цей процес, вам потрібно
створити функцію get_upcoming_birthdays, яка допоможе вам визначати, кого з колег потрібно привітати.
Функція повинна повернути список всіх у кого день народження вперед на 7 днів включаючи поточний день.

У вашому розпорядженні є список users, кожен елемент якого містить інформацію про ім'я користувача
та його день народження. Цей список виглядає наступним чином.

users = [
    {"name": "Bill Gates", "birthday": "1955.3.25"},
    {"name": "Steve Jobs", "birthday": "1955.3.21"},
    {"name": "Jinny Lee", "birthday": "1956.3.22"},
    {"name": "Sarah Lee", "birthday": "1957.3.23"},
    {"name": "Jonny Lee", "birthday": "1958.3.22"},
    {"name": "John Doe", "birthday": "1985.01.23"},
    {"name": "Jane Smith", "birthday": "1990.01.27"}
]
Оскільки дні народження колег можуть припадати на вихідні, ваша функція також повинна
враховувати це та переносити дату привітання на наступний робочий день, якщо це необхідно.

Завдання досить складне і на кожному етапі ми будемо виконувати прості завдання які
приведуть нас до виконання всього завдання в цілому. Ми застосуємо принцип програмування
"з'їсти слона по шматкам". Це метафора, яка описує підхід до розбиття великого і, здавалося б,
непосильного завдання на маленькі, легко виконувані частини. Ідея полягає в тому, що неможливо
"з'їсти слона за один раз", але якщо розділити його на маленькі шматочки, то поступово,
шматок за шматком, то завдання виконується. Цей принцип можна застосувати не тільки в програмуванні,
а й у будь-якій сфері діяльності, де потрібно впоратися з великим проєкт.
"""

"""
На першому кроці ми виконаємо роботу з датами. Мета кроку це ознайомлення з базовими операціями
над датами які нам знадобляться для цієї задачі.

Напишіть функцію string_to_date, яка приймає рядкове представлення дати в форматі "YYYY.MM.DD"
і перетворює його на об'єкт datetime.date.

Напишіть зворотну функцію date_to_string, яка приймає об'єкт datetime.date і повертає рядкове
представлення дати в форматі "YYYY.MM.DD".

Ці функції повинні працювати наступним чином:

date_string = "2024.01.01"
converted_date = string_to_date(date_string)
print(converted_date)
date_string = date_to_string(converted_date)
print(date_string)

Виконання такого коду призведе до наступного виведення:

2024-01-01
2024.01.01
"""

# from datetime import datetime
# def string_to_date(date_string):
# def date_to_string(date):

from datetime import datetime


def string_to_date(date_string):
    return datetime.strptime(date_string, "%Y.%m.%d").date()


def date_to_string(date):
    return datetime.strftime(date, "%Y.%m.%d")


current_date = string_to_date("2024.01.01")
print("string_to_date :> ", current_date)
print("date_to_string :> ", date_to_string(current_date))